let CheckTools = {
    
    //用户名正则，4到16位（字母，数字，下划线，减号）
    UserNameRegExp: /^[a-zA-Z0-9_-]{4,16}$/,

    //密码强度正则，6-16位，包括至少1个大写字母，1个小写字母
    PasswordRegExp: /^.*(?=.{6,16})(?=.*[A-Z])(?=.*[a-z]).*$/,

    //密码强度正则，6-16位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
    PasswordRegExp_Secure: /^.*(?=.{6,16})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,
    
    //Email正则
    EmailRegExp: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,
    
    //手机号正则
    regMobile : /^(0|86|17951)?(13[0-9]|15[0123456789]|17[678]|18[0-9]|14[57])[0-9]{8}$/,

    //姓名正则
    regName : /^(([a-zA-Z+\.?\·?a-zA-Z+]{2,30}$)|([\u4e00-\u9fa5+\·?\u4e00-\u9fa5+]{2,30}$))/,

    //年龄正则
    regAge:/^(?:[1-9][0-9]?|1[01][0-9]|120)$/
}

export default CheckTools